In [1]:
import pandas as pd

In [2]:
data1={
    'ID':[1,2,3,4],
    'Name':['Alice', 'Bob', 'Charlie', 'David'],
    'Age':[25, 30, 35, 40]
}
data2={
    'ID': [3, 4, 5, 6],
    'Name': ['Charlie', 'David', 'Eve', 'Frank'],
    'Score': [85, 88, 90, 95]
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

In [3]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

In [6]:
df2

   ID     Name  Score
0   3  Charlie     85
1   4    David     88
2   5      Eve     90
3   6    Frank     95

# Merging dataframes

### 1] Inner Join (Default)

In [4]:
df_inner=pd.merge(df1,df2,on='ID')

In [5]:
df_inner

   ID   Name_x  Age   Name_y  Score
0   3  Charlie   35  Charlie     85
1   4    David   40    David     88

In [7]:
pd.merge(df1,df2,on='Name')

   ID_x     Name  Age  ID_y  Score
0     3  Charlie   35     3     85
1     4    David   40     4     88

### 2] Left Join

In [8]:
df_left=pd.merge(df1,df2,on='ID',how='left')

In [9]:
df_left

   ID   Name_x  Age   Name_y  Score
0   1    Alice   25      NaN    NaN
1   2      Bob   30      NaN    NaN
2   3  Charlie   35  Charlie   85.0
3   4    David   40    David   88.0

In [10]:
pd.merge(df1,df2,on='Name',how='left')

   ID_x     Name  Age  ID_y  Score
0     1    Alice   25   NaN    NaN
1     2      Bob   30   NaN    NaN
2     3  Charlie   35   3.0   85.0
3     4    David   40   4.0   88.0

### 3] Right join

In [11]:
df_right=pd.merge(df1,df2,on='ID',how='right')

In [12]:
df_right

   ID   Name_x   Age   Name_y  Score
0   3  Charlie  35.0  Charlie     85
1   4    David  40.0    David     88
2   5      NaN   NaN      Eve     90
3   6      NaN   NaN    Frank     95

### 4] Outer join

In [14]:
df_outer=pd.merge(df1,df2,on='ID',how='outer')

In [15]:
df_outer

   ID   Name_x   Age   Name_y  Score
0   1    Alice  25.0      NaN    NaN
1   2      Bob  30.0      NaN    NaN
2   3  Charlie  35.0  Charlie   85.0
3   4    David  40.0    David   88.0
4   5      NaN   NaN      Eve   90.0
5   6      NaN   NaN    Frank   95.0

### Merge on mutliple columns

In [16]:
df_id_name=pd.merge(df1,df2,on=['ID','Name'],how='left')

In [17]:
df_id_name

   ID     Name  Age  Score
0   1    Alice   25    NaN
1   2      Bob   30    NaN
2   3  Charlie   35   85.0
3   4    David   40   88.0

In [18]:
pd.merge(df1,df2,on=['ID','Name'])

   ID     Name  Age  Score
0   3  Charlie   35     85
1   4    David   40     88

# Join

The join method is used to join DataFrames on their index. It's convenient for combining columns of two DataFrames.

In [57]:
df1_jo=df1.drop(columns='ID')
df2_jo=df2.drop(columns='ID')

In [76]:
#chaning the index value
df2_jo.index=range(2,len(df2_jo)+2)

In [77]:
df1_jo

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [78]:
df2_jo

      Name  Score
2  Charlie     85
3    David     88
4      Eve     90
5    Frank     95

### 1] Left Join (Default)

In [79]:
df_l=df1_jo.join(df2_jo,lsuffix='_df1',rsuffix='_df2')

In [80]:
df_l

  Name_df1  Age Name_df2  Score
0    Alice   25      NaN    NaN
1      Bob   30      NaN    NaN
2  Charlie   35  Charlie   85.0
3    David   40    David   88.0

### 2] Right join

In [81]:
df_r=df1_jo.join(df2_jo,how='right',lsuffix='_df1',rsuffix='_df2')

In [82]:
df_r

  Name_df1   Age Name_df2  Score
2  Charlie  35.0  Charlie     85
3    David  40.0    David     88
4      NaN   NaN      Eve     90
5      NaN   NaN    Frank     95

### 3] Outer join

In [83]:
df_o=df1_jo.join(df2_jo,lsuffix='_df1',rsuffix='_df2',how='outer')

In [84]:
df_o

  Name_df1   Age Name_df2  Score
0    Alice  25.0      NaN    NaN
1      Bob  30.0      NaN    NaN
2  Charlie  35.0  Charlie   85.0
3    David  40.0    David   88.0
4      NaN   NaN      Eve   90.0
5      NaN   NaN    Frank   95.0

### 4] Inner join

In [88]:
df_i=df1_jo.join(df2_jo,lsuffix='_df1',rsuffix='_df2',how='inner')

In [89]:
df_i

  Name_df1  Age Name_df2  Score
2  Charlie   35  Charlie     85
3    David   40    David     88

# Concatenation

The concat function concatenates DataFrames along a particular axis (rows or columns).

In [93]:
df1_jo

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [94]:
df2_jo

      Name  Score
2  Charlie     85
3    David     88
4      Eve     90
5    Frank     95

### 1] Concatenate Along Rows (Axis 0)

In [91]:
df_row=pd.concat([df1_jo,df2_jo],axis=0)

In [92]:
df_row

      Name   Age  Score
0    Alice  25.0    NaN
1      Bob  30.0    NaN
2  Charlie  35.0    NaN
3    David  40.0    NaN
2  Charlie   NaN   85.0
3    David   NaN   88.0
4      Eve   NaN   90.0
5    Frank   NaN   95.0

### 2] Concatenate Along Columns (Axis 1)

In [95]:
df_col=pd.concat([df1_jo,df2_jo],axis=1)

In [96]:
df_col

      Name   Age     Name  Score
0    Alice  25.0      NaN    NaN
1      Bob  30.0      NaN    NaN
2  Charlie  35.0  Charlie   85.0
3    David  40.0    David   88.0
4      NaN   NaN      Eve   90.0
5      NaN   NaN    Frank   95.0

# Grouping & Aggregating the data

### groupby() & agg()

The groupby() method is used to group data by one or more columns and apply aggregation functions.

The groupby method is often used with agg to perform multiple aggregations on grouped data.

In [97]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Helen'],
    'Age': [25, 30, 35, 40, 30, 45, 40, 35],
    'Gender': ['F', 'M', 'M', 'M', 'F', 'M', 'F', 'F'],
    'Score': [85, 88, 90, 78, 92, 85, 88, 93]
}

df = pd.DataFrame(data)

In [98]:
df

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   30      M     88
2  Charlie   35      M     90
3    David   40      M     78
4      Eve   30      F     92
5    Frank   45      M     85
6    Grace   40      F     88
7    Helen   35      F     93

## Intro to Grouping

In [105]:
df.groupby('Age').sum()

C:\Users\91882\AppData\Local\Temp\ipykernel_2784\160472478.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Age').sum()

     Score
Age
25      85
30     180
35     183
40     166
45      85

NOTE : To avoid the warning and ensure that only numeric columns are summed, 
you can explicitly set the numeric_only parameter to True.

In [106]:
df.groupby('Age').sum(numeric_only=True)

     Score
Age
25      85
30     180
35     183
40     166
45      85

## Aggregation function to know to perform grouping with aggregation

1. mean(): Computes the mean of each group.
2. sum(): Computes the sum of each group.
3. size(): Computes the size (count) of each group.
4. count(): Counts the non-NA cells for each group.
5. min(): Computes the minimum value of each group.
6. max(): Computes the maximum value of each group.
7. std(): Computes the standard deviation of each group.
8. var(): Computes the variance of each group.
9. median(): Computes the median of each group.
10. first(): Computes the first value in each group.
11. last(): Computes the last value in each group.
12. nth(n): Computes the nth value in each group.
13. apply(func): Applies a custom function to each group.
14. aggregate() or agg(): Applies one or more functions to the groups

In [108]:
d=df.groupby('Gender')

### 1] mean() -  Computes the mean of each group.

In [110]:
d.mean(numeric_only=True)

         Age  Score
Gender
F       32.5  89.50
M       37.5  85.25

### 2] sum() - Computes the sum of each group.

In [111]:
d.sum(numeric_only=True)

        Age  Score
Gender
F       130    358
M       150    341

### 3] size() - Computes the size (count) of each group.

In [112]:
d.size()

Gender
F    4
M    4
dtype: int64

### 4] count() - Counts the non-NA cells for each group.

In [113]:
d.count()

        Name  Age  Score
Gender
F          4    4      4
M          4    4      4

### 5] min() - Computes the minimum value of each group.

Note : for string or char it takes lexographically minimum val

In [114]:
d.min()

         Name  Age  Score
Gender
F       Alice   25     85
M         Bob   30     78

### 6] max() - Computes the maximum value of each group.

Note : for string or char it takes lexographically maximum val

In [115]:
d.max()

         Name  Age  Score
Gender
F       Helen   40     93
M       Frank   45     90

### 7] std() - Computes the standard deviation of each group.

In [118]:
d.std(numeric_only=True)

             Age     Score
Gender
F       6.454972  3.696846
M       6.454972  5.251984

### 8] var() - Computes the variance of each group.

In [119]:
d.var(numeric_only=True)

              Age      Score
Gender
F       41.666667  13.666667
M       41.666667  27.583333

### 9]  median() - Computes the median of each group.

In [121]:
d.median(numeric_only=True)

         Age  Score
Gender
F       32.5   90.0
M       37.5   86.5

### 10] first() - Computes the first value in each group.

In [122]:
d.first()

         Name  Age  Score
Gender
F       Alice   25     85
M         Bob   30     88

### 11] last() - Computes the last value in each group.

In [123]:
d.last()

         Name  Age  Score
Gender
F       Helen   35     93
M       Frank   45     85

### 12] nth() - Computes the nth value in each group.

In [124]:
d.nth(2)

         Name  Age  Score
Gender
F       Grace   40     88
M       David   40     78

### 13 ] agg() - Applies one or more functions to the groups

#### --1] Applying inbuilt aggregate function to the specific column

In [126]:
df.groupby('Gender').agg({
    'Age':['mean','median','min'],
    'Score':['max','std','var'],
    'Name':['first','last']
    
})

         Age            Score                        Name
        mean median min   max       std        var  first   last
Gender
F       32.5   32.5  25    93  3.696846  13.666667  Alice  Helen
M       37.5   37.5  30    90  5.251984  27.583333    Bob  Frank

#### --2] Applying custom function to the column

In [127]:
def custom(x):
    return x.std()/x.var()

In [130]:
def min_max(x):
    return x.max()-x.min()

In [131]:
df.groupby('Gender').agg({
    'Age':['min',custom],
    'Score':[min_max]
})

       Age             Score
       min    custom min_max
Gender
F       25  0.154919       8
M       30  0.154919      12

# Compare

Rules for Using compare Function
1. Identical Structure:
The DataFrames to be compared must have the same shape (number of rows and columns).
They must have the same column names and index labels.

2.Same Data Types:
The corresponding columns in both DataFrames should have the same data types.

3.Alignment:
If the DataFrames are not aligned (i.e., they don't have the same index or columns), you need to align them using merge, join, or reindex operations before comparing.

4.NaN Handling:
By default, compare treats NaN values as equal. If you want to treat NaNs as different, you can use the keep_equal parameter and set it to False.

5.Parameters:
align_axis: Specifies whether to align the comparison horizontally (axis=1) or vertically (axis=0). Default is 1 (columns).
keep_shape: If True, all rows and columns are kept in the result, even if they are equal. Default is False.
keep_equal: If True, equal values are shown in the result. Default is False.
result_names: A tuple specifying the suffixes for the compared columns in the result. Default is ('self', 'other').

In [138]:
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
}

data2 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bobby', 'Charlie', 'Dave'],
    'Age': [25, 30, 36, 40]
}

In [139]:
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

In [140]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

In [141]:
df2

   ID     Name  Age
0   1    Alice   25
1   2    Bobby   30
2   3  Charlie   36
3   4     Dave   40

In [142]:
df1.compare(df2)

    Name          Age
    self  other  self other
1    Bob  Bobby   NaN   NaN
2    NaN    NaN  35.0  36.0
3  David   Dave   NaN   NaN